{
    "score": {
        "35": 0.2712220056,
        "22": 0.1221361034,
        "37": 0.1010659431,
        "30": 0.0891694966,
        "47": 0.0817523474,
        "42": 0.0130220119,
        "36": 0.0,
        "28": 0.0,
        "29": 0.0,
        "31": 0.0,
        "32": 0.0,
        "33": 0.0,
        "34": 0.0,
        "38": 0.0,
        "26": 0.0,
        "39": 0.0,
        "40": 0.0,
        "41": 0.0,
        "43": 0.0,
        "44": 0.0,
        "45": 0.0,
        "46": 0.0,
        "48": 0.0,
        "27": 0.0,
        "25": 0.0,
        "1": 0.0,
        "11": 0.0,
        "2": 0.0,
        "3": 0.0,
        "4": 0.0,
        "5": 0.0,
        "6": 0.0,
        "7": 0.0,
        "8": 0.0,
        "9": 0.0,
        "10": 0.0,
        "13": 0.0,
        "24": 0.0,
        "14": 0.0,
        "15": 0.0,
        "16": 0.0,
        "17": 0.0,
        "18": 0.0,
        "19": 0.0,
        "20": 0.0,
        "21": 0.0,
        "23": 0.0,
        "49": 0.0
    },
    "skills": {
        "35": "Java and Java EE, JSF, Spring, Struts, and Hibernate",
        "22": "System Testing, Load\/Performance Testing, FIX.FAST, C\/C++, Java, Windows, Linux",
        "37": "Need a strong core Java Developer with some good Data experience. Must have experience with distributed computing.",
        "30": "Bachelor's degree with 5 years of experience developing software applications in C++ preferably in a Linux environment is required. Experience with .NET or Java preferred.",
        "47": "Looking for two-to-three Senior Java Developers with experience in eCommerce. Strong Java, Spring Framework and Hibernate ORM. The ideal candidate will have experience building their own e-commerce product or working with an existing ecommerce site. Looking for typical eCommerce experience such as PIM, PCI, shopping carts, payment gateways, catalogs, etc. Any experience with BroadLeaf, ElasticPath or KonaKart is a plus. My client will train on the eCommerce tools",
        "42": "DESCRIPTION Do you want to help build a highly personalized homepage that greets each of our millions of customers worldwide every time they visit Amazon.com? Are you interested in building data pipelines that process petabytes of customer behavior data? Amazon's Homepage Personalization team develops and supports personalization and recommendations for Amazon customers across music, books, movies, fashion, and everything else that Amazon offers. We analyze petabytes of implicit and explicit feedback data on our hundreds of millions of customers and billions of products in order to guide the development of a meaningful and highly personalized homepage experience. We are looking for an experienced and forward thinking software engineer with a focus on data engineering to join our team. This person will work closely with other software engineers and machine learning scientists to design and implement predictive, scalable models for everything from product recommendations to personalized mobile content layouts. You will work directly with machine learning scientists to scale up collaborative filtering models on retail purchases, Prime Video views, Prime Music streams, and other Amazon data to deeply understand our customers. This is one of the foremost roles in data engineering with the opportunity to reach millions of customers on one of the highest traffic consumer websites in the world. If you are passionate about data engineering, software engineering and personalization at scale then we encourage you to apply. BASIC QUALIFICATIONS - BS or MS degree in computer science or related field. - Strong coding experience, preferably with Scala, Python, Java, or C++. - Strong grasp of data structures and algorithms. - Ability to explain complex issues in technical and non-technical terms. - Cares deeply about agile software practices, data driven development, and collaborating with other engineers and researchers. - Working knowledge of Hadoop, Spark, Redshift, DynamoDB, Kinesis, or other big data technologies. PREFERRED QUALIFICATIONS - Experience with supervised and unsupervised machine learning models. - Experience with collaborative filtering and recommender systems. - Experience running and evaluating AB Tests.",
        "36": "Consulting, Database, Lifecycle, Management, Metrics, PMP, Project, Sales, SalesForce, Scheduling, Telecommunications",
        "28": "(INFORMATION SECURITY over 1 year(s) OR CYBER SECURITY over 1 year(s) OR SECURITY over 1 year(s) ) AND(FIREEYE OR FIRE EYE )",
        "29": "C and C++, Linux, UNIX",
        "31": "Development, IT, Network, Project, Sales",
        "32": "Android, Mobile",
        "33": "Scheduling, Primavera 6.0, Unifier, MS Project Stadard, EIT, Construction, Pharma or Biotech",
        "34": "AI, Maya, Browzwear, 3D",
        "38": ".NET and C#, SQl",
        "26": "Angular.JS, React, Node.js, JavaScript",
        "39": "Manual and Automation Mobile testing experience-Desktop applications, Consumer Electronics Devices, and Websites",
        "40": "Project Management, Operations Analysis, BANKING, (Financial Services, Wealth Management, Regulated Environment, Info Sec, Security and Risk Management,",
        "41": "Informatica Admin,Oracle,Sql",
        "43": "Analysis, Analyst, Business Analyst, Consulting, Data Analysis, Development, Excel, Manager, Outlook, PowerPoint, Project, SQL, Supervision",
        "44": "(SITE OR ON SITE OR ON-SITE ) AND(MONITOR OR MONITORING ) AND(PHARMA OR PHARMACEUTICAL COMPANIES ) AND(CRA OR CLINICAL RESEARCH ASSOCIATE )",
        "45": "Telecommuting not available Travel not required",
        "46": "(See Job Description)",
        "48": "Electrical Engineering degree with experience in scientific programming, especially C\/C++, GPS or other navigation systems; geolocation observable processing.",
        "27": "selenium testing automation",
        "25": "Do you want a chance to directly improve the customer experience for millions of customers a day? This position is a Product Manager in the Customer Experience team for Fulfillment by Amazon and Amazon Global Selling organization. Our vision is to transform global commerce by bringing selection from around the world to Customers anywhere in the world, with the same great customer experience Buyers expect from Amazon. In this role, you will set strategy and policy, build processes, and evangelize for technology solutions that allow third party Sellers from all over the world to bring hundreds of millions of new items to Amazon's 11 Marketplaces worldwide. You will determine what experience these Sellers must offer our customers, create the incentives and enforcement mechanisms to achieve this experience, and frequently audit the results. Responsibilities for this position will include creation of programs that drive improvement in our key customer experience metrics, management of global programs and stakeholders, and driving alignment for new programs at high levels of the organization. This position will also have management responsibility for product managers, data analysts, and an operations team. From Jeff Bezos' annual letter to Amazon shareholders: \"To further globalize Marketplace, we're now helping sellers in each of our geographies - and in countries where we don't have a presence - reach out to our customers in countries outside their home geographies. We hosted merchants from more than 100 different countries last year, and helped them connect with customers in 185 nations. Almost one-fifth of our overall third-party sales now occur outside the sellers' home countries, and our merchants' cross-border sales nearly doubled last year. In the EU, sellers can open a single account, manage their business in multiple languages, and make products available across our five EU websites. More recently, we've started consolidating cross-border shipments for sellers and helping them obtain ocean shipping from Asia to Europe and North America at preferential, bulk rates.\" Fulfillment by Amazon (FBA) is an Amazon service for our third-party Sellers. The FBA team partners with Sellers and our Amazon Fulfillment Centers to create a seamless experience for Sellers to leverage our world-class facilities. 71% of our FBA Sellers report more than a 20% increase in unit sales after joining FBA. In a very real way, we are changing lives with the work we do. Our FBA employees wake up every day thinking about how to enable our Sellers to be successful on our platform. Enabling Seller success allows us to provide Amazon customers with unparalleled selection and pricing. FBA is a win for Sellers and a win for customers. Want to learn more about FBA? ? Seller's success stories: SellerSuccess ? A free book of stories from small businesses\/sellers, authors, and innovators that are thriving on Amazon: Transformations-ebook",
        "1": "linux\/unix, network monitoring, incident response, systems administration, security accessment",
        "11": "Unix, IAM, Scripting knowledge, OIM, Windows, Linux",
        "2": "Enterprise Solutions Architecture, business inteligence, reports, reporting",
        "3": "Please see job description",
        "4": "Configuration Management, Developer, Linux, Management, Process Engineering, VMware",
        "5": "FICO, AR, AP, Asset Management, HAHA",
        "6": "Cisco, DNS, HTTP, Networking, Network Engineer, Security, Video, VPN, Wireless",
        "7": ".NET , C#, MVC, RESTful web services, HTTP, AWS, Azure, OOP",
        "8": "C++, Developer, Development, JavaScript, User Interface",
        "9": "(See Job Description)",
        "10": "Openstack",
        "13": "Consulting, Project, Sales, Sales Engineer",
        "24": "MATLAB, LabVIEW",
        "14": "mobile device",
        "15": "(See Job Description)",
        "16": "QA",
        "17": "Lawson Supply Chain",
        "18": "Desktop, Hardware, Network, Software, Systems, Windows",
        "19": "(See Job Description)",
        "20": "Analysis, Analyst, Application, Business Analyst, Business Requirements, Excel, IT, PowerPoint, Project",
        "21": "(See Job Description)",
        "23": "Agile, CASE, Consulting, Defect Management, Manager, Management, Project, Project Management",
        "49": "Active Secret clearance required, knowledge of product development and procedures, including knowledge of general accounting. Ability to manage a diverse range of technical operations"
    }
}