{
    "Job_Id": {
      "0": "JB001",
      "1": "JB002",
      "2": "JB003",
      "3": "JB005",
      "4": "JB006",
      "5": "JB007",
      "6": "JB008",
      "7": "JB009",
      "8": "JB012",
      "9": "JB013"
    },
    "jobdescription": {
      "0": "Looking for Selenium engineers...must have solid java coding skills I have several openings some 3 month to hire some 6...must be able to go PERM  This can be someone with 0-5 years of experience. Most important qualities are Eagerness and Aptitude. POSITION PURPOSE - Do you want to be on the forefront of cutting edge technology, introduce solutions to problems that didn’t exist before, and have the ability to see the result of your successes? Our client assures growth by collaborating with development teams and creating tools that aid engineers in building, testing, debugging, and releasing software. We touch millions of users by increasing the rate of development and ensuring our products are methodically tested. We are experts in software health, testability, and sustainability. As a Software Engineer in Test at our client, you can expect to build flexible and scalable solutions while working on some of the most complex challenges in large-scale computing by utilizing your skills in data structures and object oriented programming. MAJOR TASKS, RESPONSIBILITIES AND KEY ACCOUNTABILITIES - Lead and contribute to engineering efforts from planning to execution and delivery to solve complex engineering problems in tools and testing. • Design and build advanced automated testing frameworks. • Build tooling to help Developers measure and increase their velocity. • Adopt best practices in software health, testing, and sustainability. • Analyze and break down complex software systems and collaborate with Development teams to improve the overall design. NATURE AND SCOPE - • Typically reports to Manager Test Engineering • No associates report to the person in this role on a permanent basis • Analyze and resolve complex quality issues critical to solution delivery • Fast-paced environment of freedom and responsibility PREFERRED QUALIFICATIONS • Hands on Java Development experience • Proficient in Ab Initio ETL and Batch testing • Hands-on knowledge of Soap UI, ITKO Lisa, and Selenium • Hands on experience with Unix, KSH, and Bourne Shell Scripting • Strong scripting knowledge with Java, Groovy and Jmeter • Strong development experience working on web services (REST and SOAP) • Experience building test automation frameworks for web services using Soap UI, Groovy, or Lisa • Proficient in SQL • Working knowledge of SVN and Jenkins – build and development process • eCommerce/Retail QA experience • Excellent written and verbal communication skills • Self-motivated with a strong work ethic and a positive attitude • Desire to work in a fast-paced, results orientated team • Experience with a scripting language such as Perl • Passion to understand, learn, dissect and improve new technologies • Proficient in one or more of the following: Retail applications, Windows platform, UNIX platforms, JAVA, Relational Databases, Websphere Application Server, Websphere Commerce, Websphere MQ • Comprehensive understanding of systems, applications and networks KNOWLEDGE, SKILLS, ABILITIES AND COMPETENCIES - • Proficient in one or more of the following: Retail applications, Windows platform, UNIX platforms, MVS COBOL, JAVA, J2EE, Relational Databases, Websphere Application Server, Websphere Commerce, Websphere MQ, Networking (Voice, LAN, WAN), SAP, Siebel, Peoplesoft • Comprehensive understanding of systems, applications and networks • Strong problem solving and analytical skills • Strong oral and written communication skills • Ability to coordinate and collaborate across cross-functional teams ",
      "1": "The University of Chicago has a rapidly growing security program with many opportunities for a motivated person to work in a variety of roles and many technical areas.  This position is responsible for providing incident response, information security assessment, monitoring, and system administration under the general direction of the Information Security Officer and the Lead Information Security Engineer. Essential Functions: Execute IT Security Network Monitoring and Incident Response procedures. Lead or participate in IT Security projects. Administer IT Security systems, including updates, backups, and upgrades Consult, advise, and provide security assessment services to application development or acquisition projects to assess security requirements and controls and to ensure that security controls are implemented as planned. Research security issues and contribute to IT Security communications, web pages, blogs, and awareness materials. Document internal processes, write security standards and guidelines. Other duties as assigned  Qualifications:Bachelor's degree OR a minimum of four years of experience in the Information Technology field OR an equivalent combination of education and experience required.  Minimum two years of professional experience in a technical Information Security role required. Experience administering linux/unix systems is required. Experience administering Windows systems is preferred. Experience with programming or scripting languages such as Perl or Python strongly preferred.  The University of Chicago is an Affirmative Action/Equal Opportunity/Disabled/Veterans Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, status as an individual with a disability, protected veteran status, genetic information, or other protected classes under the law. For additional information please see the University's Notice of Nondiscrimination.Staff Job seekers in need of a reasonable accommodation to complete the application process should call 773-834-1841 or email talentacquisition@uchicago.edu with their request.",
      "2": "GalaxE.SolutionsEvery day, our solutions affect people throughout the world. From Fortune 100 companies to start-ups, GalaxE develops and implements strategic projects that are critical to the success of customers’ businesses and the lives of tens of millions of people. For over twenty-five years, we have grown and evolved into a multi-national firm that employs over 2000 team members worldwide. But we’re not done evolving. It took collaboration and innovation to get here, and it takes collaboration and innovation to get where we (and our customers) want to be tomorrow.   What does this mean for our employees? They have the security of an established company, with the benefits of working for a company where great minds, hard work, leadership and innovation are highly regarded and rewarded. As Thomas Edison said, “There’s a way to do it better – find it”. We want our employees to find it. We’re looking for creative people, with an entrepreneurial spirit, looking to work on awesome projects! Sound like you? Come work with us! Find out for yourself what it means to be part of the GalaxE team. It’s not always easy, but important work never is. #WeAreGalaxE  Develop a practical roadmap for an enterprise-wide BI reporting and analytics platform with consideration to business objectives, technological considerations and budget. Define the overall BI data architecture which could include: ETL processes, ODS, EDW, data marts and data lakes.Provide BI technical and architectural guidance to project and project teams to ensure that new initiatives enable effective data reporting.Develop new reporting solutions if requiredIdentify, evaluate, and provide proposals for solutions to identified process and data quality issuesDocument best practices and methodologies for development standards, data governance, version control, deployment and change management.Perform quality assurance testing of reports and dashboards, and perform user acceptance testing (UAT). Technical Experience:   Core understanding of Business Intelligence / data warehousing technologies, methodologies, and techniques of: data discovery, data sources, presentation layer, etc., with proven experience with delivering successful solutionsExcellent knowledge of data warehouse principles and reporting.Experience in the design and building of enterprise data warehouses.Extensive experience in BI report, web and mobile dashboard development. Experience in multiple database platformsExperience with data analysis, assessing data quality and developing corrective actionsThorough understanding of complex large scale data modelsUnderstanding of common SDLC practices/methodologiesExperience working with end users to gather requirementsExperience using data discovery toolsUnderstanding of RDBMS  ",
      "3": "Midtown based high tech firm has an immediate need for an innovative DevOps Engineer to help define Dev / Ops related processes, build out the automation.  In this position, the Dev / Ops Engineer will need to engineer technical solutions as well as perform process engineering. The ideal candidate has strong scripting skills for automation as well experience with configuration management, server deployment, and continuous integration and experience with tools such as Chef, Puppet, etc.  Must have experience with virtualization using VMware and Linux experience is preferred.  Experience with GO, Docker, Ansible, Microservices, and the Cloud are highly desired.   This is a permanent position with an innovative technology firm in Midtown that offers excellent benefits including bleeding edge technology, very generous PTO, matching 401(k), high-tech office environment, casual dress and a collaborative culture.  Need is IMMEDIATE!!    Category: Developer / Architect -Other",
      "4": "We are looking for a Senior SAP FICO Architect to join us fulltime and support our ongoing projects and customers. Must have excellent Pre-sales experience.Consultant should be ready for 100% travel. If interested, Please send us your updated resume, best time and contact numbers to girish(dot)bandaru(at)yash(dot)com to discuss more on this opportunity. Thanks & Regards Girish BandaruYASH Technologies773-828-4341girish.bandaru@yash.com",
      "5": "Network Engineer Job Description A Network Engineer is responsible for analyzing, designing, installing, configuring, maintaining and repairing of network infrastructure and application components. A Network Engineer performs a wide variety of evaluation, maintenance, installation and training tasks to ensure the computer network performance meets company and user satisfaction. A Network Engineer also provides direction, information, and recommendations regarding network configurations and installations. PRIMARY DUTIES AND RESPONSIBILITIES:   * Maintain a thorough understanding of the basics behind the Internet and its workings (DNS, Security, IP Routing, HTTP, VPN, Email Routing, SPAM, etc.) * Configure and setup Cisco Firewalls, VPN Concentrators and Security appliances for access to vital business applications * Design, setup and configure complex switching environments * Design, setup and configure complex wireless networking that supports open or secured access and the ability to support voice and video applications * Maintain a thorough understanding of Local Area Networking * Assist in the design of multi-server environments including IP address schemes, DNS, WINS, EtherChannel (Bonding), etc. * Configuring and installing client and server network software for upgrading and maintaining network and telecommunication systems. * Maintaining multi-site network operations and software applications, operating systems and regular maintenance with both private and public facilities * Managing assigned projects and program components to deliver services in accordance with established objectives. * Responding to inquiries from staff, administrators, service providers, site personnel and outside vendors and etc. to provide technical assistance and support * Supervising the administration of systems and servers related network to ensure availability of services to authorized users.  Date Posted: 06/10/2016",
      "6": "Bluebeam is looking for talented sr. web developers with a passion for building robust, performant, scalable, high availability web applications. You should have extensive web development experience including designing RESTful services utilizing relational and no-sql databases in a testable framework.  Want a peek at who you would be working with? Our software developers are friendly, fun, intelligent, hard-working team members devoted to developing software right.  They have an ability to see the big picture throughout the design and development process.  We are highly-collaborative so you should have a capacity to contribute to and learn from the team in constructive debates in order to coalesce multiple points of view into effective unified solutions.  We work in small fast-paced scrum-agile teams. You would be working alongside software engineers, and product and project managers who are self-starters passionate about delivering clean, dependable software solutions.  To work well with the team you should have an ability to clearly articulate solutions to complex problems both to technical and non-technical people.   What we'd need to see:5+ years of experience in a related field (Candidates will be considered for engineer or senior engineer based on experience)Bachelor’s degree or higher in a computer science or equivalent fieldExtensive use of APIs and understanding of HTTP and REST architectureExperience using OO methodologies in designing software solutionsStrong understanding of design patternsProven ability to work in a rapid release production environmentFull understanding of the SDLC Experience with developing scalable software systemsAbility to clearly articulate solutions to complex problems; when developing solutions, ability to see the big picture What we’d love to seeComfort with working in an Agile/SCRUM environmentProven Web Development experience in .NET technologies, particularly C# and Web APIUnderstanding of machine learning algorithmsExperience with cloud technologies such as Azure or AWSExperience developing microservice-based architecturesAbility and propensity to generate and share extremely delicious baked goods  If you think you are a good match for Bluebeam, please send the following:Cover Letter (Try to show us who you are.  If you send us the generic one you send to everyone else, we will be bummed.)ResumeSamples of your web development work (Be prepared to discuss) Learn more about Bluebeam here: http://careers.bluebeam.com/. ",
      "7": "This is a fulltime position for a Javascript developer for a financial software, data, and media company. This role is based our of the Midtown, NY location (candidates must work onsite). You'll be part of a team working on the application that is the glue that holds the firm's main product together and is used as a communication tool, a price dissemination system and a way to receive information from all other applications within the firm. Responsibilities:   Help us design, create and build our next-generation user interface Be a key contributor in the re-architecting of our application service layers to improve our scalability, stability and performance Work with the team, our product and our customers to define priorities and the technology we use Work with other teams and learn about our search infrastructure, core databases and how we support hundreds of applications through our APIs Required Skills and Experience:   3+ years of production-level development Solid JavaScript knowledge Must want to and like working on UI Preferred:   An understanding of C++ fundamentals Experience working on other highly visible applications  Start Date: 06/03/2016",
      "8": "Must have skills: UNIX, IAM (Identity Access Management), Scripting knowledge, and 5+ years of total experience in this role required. OIM (Oracle Identity Manager) or other similar tools are required. The ideal candidate has worked as a Systems Administrator and/or Information Security Analyst in the past.Nice to have skills: Knowledge of SQL, coding languages, and Windows are really nice to have. Active Directory is also really nice to have. DescriptionThe ideal candidate for this position will be a proactive and self-motivated professional who will work with other team members to manage access controls for our client's key information resources residing on multiple platforms, with a focus area in Windows, UNIX, Linux. The successful candidate will have strong scripting skills to support the automation effort within the team. Education/Experience:• Bachelor degree in computer management, information security or equivalent job experience• CISSP, CISA, CISM and other comparative information security certifications are preferred• 5 to 7 years computer security experience required Responsibility level:• Provide support in account provision and de-provision in Windows and UNIX systems in Active Directories/UNIX Enterprise Directories• Complete access request processing as per pre-defined sets of procedure and within agreed Service Level Agreements (SLA), resolve problem tickets and assist other security analysts as needed• Document access management procedures for assigned platforms, databases and applications; keep the access management procedures up-to-date• Proactively identify audit and compliance access related issues to reduce the risk of security exposures on the support systems and applications; coordinate access management related audit and compliance tasks, such as user access reporting and other relevant research and investigation• Flexibility to work adjusted hours, after hours and weekends to accommodate and support the existing servers/applications maintenance windows• Identify process automation opportunities on existing access management practice.• Work with team members to design and develop solutions to streamline and automate existing manual process• Flexibility to work adjusted hours with Global Team members as needed to support training and processing needs.• Exercises independent judgment with minimal direction from supervisor Qualifications/Requirements:• Detailed knowledge of the security sub-subsystems and 3rd party security products such as Oracle Identity Manager(OIM), Random Password Manager (RPM), Active Roles Servers(ARS), Etc.,• Subject matter expert on UNIX and database security products and their use on protecting information resources• Ability to gather and document business requirements and implement solutions to address them• Good working knowledge of Identity Access Management lifecycle and processes• Understanding of information security principles and IT infrastructure including operating systems, applications, communications and network protocols.• In-depth and proven knowledge in building automated solutions using various coding languages (Java, C#, VBA, vbscript, Perl and Shell script, etc.) is really nice to have.• The ability to work effectively with other functional areas and understand the operational and cultural issues relevant to achieving superior results• Must be flexible and able to manage multiple tasks and priorities on very tight deadlines.• Be a self-motivated and results oriented individual with an attention to driving aggressive project timelines and schedules• Ability to work independently and in collaboration with others to achieve a high level of success• Strong interpersonal and collaboration skills with the ability to develop, maintain and foster constructive relationships with others• Dynamic, hard-working and ambitious individual, with excellent oral and written communication skills• Have an attention to detail and advanced analytical and troubleshooting skills",
      "9": "VanderHouwen has more jobs you may like!  Find them here: http://bit.ly/1RIQfgE PLEASE JOIN OUR TALENT NETWORK: http://bit.ly/vhatalentnetwork  Joining the Talent Network with VanderHouwen & Associates (VHA) will enhance your job search and application experience. Job listings are mobile-friendly and easy to review, share, or apply. Whether you choose to just leave us your information or apply, we look forward to connecting with you. SummaryOur client is seeking an engineering manager to lead a team of 3*6 engineers working on the server side of our industry-disrupting clearing platform.Ideal candidate will be:Experienced. Have extensive experience building back-end applications and services, and managing engineersPassionate. Driven to improve your managerial skill set every day. Keen to solve interesting problems with creative and simple solutions.Pragmatic. Would rather deliver a 40% solution in two weeks than an 80% solution in six.Introspective. You recognize your strengths and seek to maximize them. You recognize your weaknesses and work around them.A good team member. We believe in the profound impact that*s possible when teams of like-minded individuals set their sights on a common goal.A mentor and coach. You embrace the role of teaching and helping others get better.ResponsibilitiesManage staffing and career development of a distributed team.Represent cultural values and coach team members.Build a team that is results-oriented and collaborative.Deliver great software in a predictable and transparent way.Hire software engineers and software engineers in test.Evaluate business needs and effectively prioritize work.Qualifications RequiredFour years of professional software engineering experience.Four years of software engineering management experience.Experience with agile software development practices.Readiness to travel occasionally.Qualifications Preferred Java and OSS fluency.Deep technical competence.Experience with service-oriented architectures.Financial services background."
    },
    "joblocation_address": {
      "0": "Atlanta, GA",
      "1": "Chicago, IL",
      "2": "Schaumburg, IL",
      "3": "Atlanta, GA",
      "4": "Chicago, IL",
      "5": "Atlanta, GA",
      "6": "Chicago, IL",
      "7": "New York, NY",
      "8": "Highlands Ranch, CO",
      "9": "Portland, OR"
    },
    "jobtitle": {
      "0": "AUTOMATION TEST ENGINEER",
      "1": "Information Security Engineer",
      "2": "Business Solutions Architect",
      "3": "DevOps Engineer",
      "4": "SAP FICO Architect",
      "5": "Network Engineer",
      "6": "Sr. Web Application Developer (Cloud Team) - Chicago",
      "7": "Front End Developer",
      "8": "9001 Data Security Administrator - Unix & IAM",
      "9": "Software Engineer Manager"
    },
    "skills": {
      "0": "QA, Test Automation",
      "1": "linux/unix, network monitoring, incident response, systems administration, security accessment",
      "2": "Enterprise Solutions Architecture, business inteligence, reports, reporting",
      "3": "Configuration Management, Developer, Linux, Management, Process Engineering, VMware",
      "4": "FICO, AR, AP, Asset Management, HAHA",
      "5": "Cisco, DNS, HTTP, Networking, Network Engineer, Security, Video, VPN, Wireless",
      "6": ".NET , C#, MVC, RESTful web services, HTTP, AWS, Azure, OOP",
      "7": "C++, Developer, Development, JavaScript, User Interface",
      "8": "Unix, IAM, Scripting knowledge, OIM, Windows, Linux",
      "9": "Java, OSS"
    },
    "Vacancies": {
      "0": 1,
      "1": 2,
      "2": 1,
      "3": 1,
      "4": 4,
      "5": 1,
      "6": 2,
      "7": 3,
      "8": 2,
      "9": 1
    },
    "Position_Close_Date": {
      "0": "1/10/2019",
      "1": "31/10/2019",
      "2": "1/10/2019",
      "3": "1/10/2019",
      "4": "30/12/2019",
      "5": "1/10/2019",
      "6": "31/10/2019",
      "7": "30/11/2019",
      "8": "31/10/2019",
      "9": "1/10/2019"
    }
  }