{  
   "score":{  
      "25":0.3125144865,
      "41":0.221337178,
      "15":0.1560819167,
      "38":1.0,
      "29":0.0,
      "30":0.0,
      "31":0.0,
      "32":0.0,
      "33":0.0,
      "34":0.0,
      "35":0.0,
      "36":0.0,
      "37":0.0,
      "3":0.0,
      "27":0.0,
      "39":0.0,
      "40":0.0,
      "42":0.0,
      "43":0.0,
      "44":0.0,
      "45":0.0,
      "46":0.0,
      "47":0.0,
      "48":0.0,
      "28":0.0,
      "26":0.0,
      "4":0.0,
      "1":0.0,
      "5":0.0,
      "6":0.0,
      "7":0.0,
      "8":0.0,
      "2":0.0,
      "10":0.0,
      "11":0.0,
      "12":0.0,
      "13":0.0,
      "14":0.0
   },
   "skills":{  
      "25":"Java and Java EE, JSF, Spring, Struts, and Hibernate",
      "41":"Angular JS, Java\/J2EE, Spring , Hibernate",
      "15":"System Testing, Load\/Performance Testing, FIX.FAST, C\/C++, Java, Windows, Linux",
      "38":".Net, Algorithms, Developer, JavaScript, Linux, OOD, OOP, Programming, Systems, Windows",
      "29":"Informatica Admin,Oracle,Sql",
      "30":"Analysis, Analyst, Business Analyst, Consulting, Data Analysis, Development, Excel, Manager, Outlook, PowerPoint, Project, SQL, Supervision",
      "31":"AI, Maya, Browzwear, 3D",
      "32":"Electrical Engineering degree with experience in scientific programming, especially C\/C++, GPS or other navigation systems; geolocation observable processing.",
      "33":"Active Secret clearance required, knowledge of product development and procedures, including knowledge of general accounting. Ability to manage a diverse range of technical operations",
      "34":".Net, TFS, Web services, WCF, JQuery, AJAX, JavaScript, VB, VB Script, XML\/XSL, CSS, architectural design patterns",
      "35":"Angular.JS, React, Node.js, JavaScript",
      "36":"Development, IT, Network, Project, Sales",
      "37":"HTML, JavaScript, CSS, AJAX",
      "3":"Configuration Management, Developer, Linux, Management, Process Engineering, VMware",
      "27":".NET and C#, SQl",
      "39":"Analyst, Business Analyst, Business Requirements, Consulting, Development, Lifecycle, Management, MS Office, Project, Testing",
      "40":".Net, Algorithms, Developer, JavaScript",
      "42":"Algorithm Engineer , Computer vision, Open CV ,algorithm R&D experiences, Android programming will be a plus.",
      "43":"Node.js, JavaScript",
      "44":"SAP APO, MS Excel, BW reporting, Pharma or Biotech",
      "45":"Linux, OOD, OOP, Programming, Systems, Windows",
      "46":"Project coordinator,procurement,budget",
      "47":"DEVOPS ENGINEER, SYSTEM ENGINEER, BUILD RELEASE ENGINEER, PYTHON, SHELL, PERL, BASH, LINUX, UNIX, RHEL, CENTOS, PERFORCE, JENKINS, MAVEN, CONTINUOUS INTEGRATION",
      "48":"Oracle R12 E-Business, General Ledger, Asset Management, Projects, AME, Workflow etc.",
      "28":"Project Management, Operations Analysis, BANKING, (Financial Services, Wealth Management, Regulated Environment, Info Sec, Security and Risk Management,",
      "26":"Consulting, Database, Lifecycle, Management, Metrics, PMP, Project, Sales, SalesForce, Scheduling, Telecommunications",
      "4":"FICO, AR, AP, Asset Management, HAHA",
      "1":"linux\/unix, network monitoring, incident response, systems administration, security accessment",
      "5":"Cisco, DNS, HTTP, Networking, Network Engineer, Security, Video, VPN, Wireless",
      "6":".NET , C#, MVC, RESTful web services, HTTP, AWS, Azure, OOP",
      "7":"C++, Developer, Development, JavaScript, User Interface",
      "8":"Unix, IAM, Scripting knowledge, OIM, Windows, Linux",
      "2":"Enterprise Solutions Architecture, business inteligence, reports, reporting",
      "10":"Consulting, Project, Sales, Sales Engineer",
      "11":"QA",
      "12":"Lawson Supply Chain",
      "13":"Desktop, Hardware, Network, Software, Systems, Windows",
      "14":"Analysis, Analyst, Application, Business Analyst, Business Requirements, Excel, IT, PowerPoint, Project"
   },
   "Job_Id":{  
      "25":"JB036",
      "41":"JB059",
      "15":"JB023",
      "38":"JB056",
      "29":"JB042",
      "30":"JB044",
      "31":"JB048",
      "32":"JB049",
      "33":"JB050",
      "34":"JB052",
      "35":"JB053",
      "36":"JB054",
      "37":"JB055",
      "3":"JB005",
      "27":"JB039",
      "39":"JB057",
      "40":"JB058",
      "42":"JB061",
      "43":"JB062",
      "44":"JB063",
      "45":"JB065",
      "46":"JB066",
      "47":"JB067",
      "48":"JB068",
      "28":"JB041",
      "26":"JB037",
      "4":"JB006",
      "1":"JB002",
      "5":"JB007",
      "6":"JB008",
      "7":"JB009",
      "8":"JB012",
      "2":"JB003",
      "10":"JB014",
      "11":"JB017",
      "12":"JB018",
      "13":"JB019",
      "14":"JB021"
   },
   "jobdescription":{  
      "25":"PLEASE JOIN OUR TALENT NETWORK: http:\/\/bit.ly\/vhatalentnetwork Joining the Talent Network with VanderHouwen & Associates (VHA) will enhance your job search and application experience. Job listings are mobile-friendly and easy to review, share, or apply. Whether you choose to just leave us your information or apply, we look forward to connecting with you. SummaryAssists supervisor with leadership and coordination of a team designing, implementing, documenting, and maintaining Java web applications. Works with BSA team to obtain requirements, prioritize, and plan the delivery of solutions. Provides guidance and coordination of technical implementations that adhere to enterprise system architecture, design, and implementation standards. Coordinates with other units to identify and schedule delivery of cross-team dependencies. Determines resource requirements and allocations. Assigns tasks to the team members, monitors the alignment with the overall project goals and reports on progress to various levels of management.Responsibilities Works with business representatives, clients, business partners, project managers, and team members to define requirements for applications targeted for the corporate internet\/ intranet.Works with project managers, supervisors, and team members to determine work tasks and allocate resources.Leads the development team through solution design, implementation, and deployment in coordination with other IT and business departments.Identifies and resolves design and implementation issues and conflicts.Leads and coordinates the maintenance and enhancement of Internet\/Intranet applications. Provides technical support to application administrators and staff.Provides development and production support status updates to management.Develops business relationships with clients and business partners. Strong understanding of client business processes needed.Resolves issues that arise with vendor technical support.Performs other duties as assigned.Qualifications Bachelor degree or equivalent specializing in Computer Science, Math, Business, and\/or Engineering.Extensive understanding of web technologies and programming languages. Ability to keep current with emerging internet technologies.5+ years computer programming experience in Java and Java EE. Experience with JSF, Spring, Struts, and Hibernate preferred.Solid background in client\/server programming and relational database systems.Outstanding analytical, problem solving, organizational, and detail orientation skills.Strong ability to negotiate, prioritize, determine tasks and allocate resources.Ability to work well under pressure, work with frequent interruptions, and shifting priorities.Maintain confidentiality and project a professional business image.",
      "41":"Required Skills                                   1.      6-9 years of experience in software development.2.      Experience working with MVC based front-end library Angular JS3.      Strong expertise in Java\/J2EE, Spring , Hibernate.4.      Experience with SQL\/NoSQL databases.5.      Responsible for module design \/ high architecture.6.      Participate in customer interaction, code review and follow-up.7.      Work closely with the development team to optimize and improve the e-commerce platform to grow subscription business. This involved identifying opportunities , developing requirements and co-ordinating with QA. ",
      "15":"Our client is the world’s premier voice and electronic interdealer broker and the source of global market   information and commentary for professionals in the international financial markets. The Group is active in the wholesale markets in interest rates, credit, commodities, foreign exchange and equity derivatives.Our client is currently seeking a Sr. Systems Test Engineer  for a fulltime position in Parsippany, NJ.Principal Responsibilities & AccountabilitiesConduct the entire system certification effort for a project with minimal supervision.Serve as the principal system engineer for major test efforts; lead the effort of other system engineers and application testers as requiredRepresent the group in requirement, specification, and design review meetings and contribute constructive feedback to the presenters in the group’s area of expertise.Create test tools to perform API level testingPerform Load and Performance Testing for C \/ C++, Java and Adobe Flash based applications.Create status and test result reports for management and represent the group in status meetings.Estimate certification effort for projects and ad-hoc testing requests.Determine and execute appropriate system-side testing for each project outside of requirements.Build, install and fallback software releases and database schemas in lab environments.Support operations personnel for critical production issues as needed.Write advanced tools and scripts to aid certification efforts and simplify operations procedures.Experience with VM, configuring VM on both Windows and Linux platforms CompetenciesMastery of Solaris and Linux operating systems.Working knowledge of OpenVMS and WindowsAble to install and configure new hardware and software with minimal assistance.Knowledge of Mercury Interactive suite of automated testing tools (LoadRunner\/Performance Center, QTP and Quality Center)Working knowledge of TCP\/IP and routing protocols.Knowledge of Microsoft Office suite of products.Working knowledge of SQL – can create ad-hoc queries to verify test results or troubleshoot issues. Oracle DBA-type experience a plus.Programming experience, preferably C\/C++, Java and shell scripting.Knowledge of software methodologies (Agile and Scrum)Qualifications & Experience Minimum of bachelor's degree or equivalent in computer science, master’s degree preferred.Atleast 4 years relevant experience on Systems testing, Load and Performance testing for C\/ C++, JAVA and Adobe Flash based applications4 years’ experience with manual testing.Knowledge of foreign exchange\/banking and market data industriesMinimum 7 years of work experience in the Information Technology industry.Working knowledge of de facto industry standard software (Oracle, HP OpenView, etc.) a plus.Knowledge of Networking Concepts is preferable.knowledge on Tervela or any MQ messaging is preferableknowledge on Google protocol buffer (GPB) and FIX\/FAST is preferableknowledge on configuring VM on both Windows and Linux platforms",
      "38":"Description:   Our client's Open Software Frameworks team is building a variety of products used by both independent software vendors and in-house developers. Their diverse portfolio of products includes Application Portal, Geo Spatial Mapping platform and IDE used to build their terminal applications. This team is contributing to a number of cutting-edge open source projects. Based on the breadth of the team's work, you will need to be a strong full stack developer. You strive to design, implement and support the ideal solution. Balance between elegant design and system performance and reliability is always at the front of your mind. You will have the opportunity to work closely with users, UX and Product teams. Requirements:   * 3+ years of experience programming in C\/C++ * 3+ years of experience with HTML5, CSS and JavaScript * Strong OOD\/OOP skills and experience applying modern design patterns * Knowledge of algorithms, standard data structures and multithreading We'd love to see: * Experience with C#, .Net internals and WPF * Experience developing distributed systems in a Windows or Linux environment * Familiarity with and understanding of an Agile methodology If you have the described qualifications and are interested in this exciting opportunity, please apply! About SWATT:   The Genesis10 Software and Technology Team (SWATT) is a specialized recruiting service focused on helping accomplished software developers, programmers, platform engineers and elite technology professionals find once-in-a-lifetime career opportunities in New York City with the world's most advanced technology organizations. Whether local to New York or relocating from across North America, we take an authentic approach to helping people make life-changing technology career decisions. For more information go to http:\/\/swatt.genesis10.com\/ \"Genesis10 is an Equal Opportunity Employer, M\/F\/D\/V\"  Start Date: 06\/27\/2016",
      "29":"Administering the Informatica environmentApply patches \/ upgrades \/ hotfixes for Informatica Power CenterMonitor performance, troubleshoot, and tune ETL processesWill be responsible for 24x7 supportWork with Informatica vendor on any issues that ariseSupport the Informatica developer team as neededExperience and SkillsMust have demonstrated experience in Informatica suite of productsSeveral years’ experience in building\/implementing scalable, reliable and high performance ETL architecturesProficiency with RDBMS systems, SQL, Oracle PL\/SQL, UNIX shell scripting, and database optimizations  I kindly request to apply resumes with genuine experience only Project start date is in second week of JulyKindly send your resumes to yag{dot}rao{at}mygoconsulting{dot}com..You can reach me on Three*Three*One---Four*Two*Five---Seven*Seven*Zero*Five Regards,Yagneshwar Rao yag.rao@mygoconsulting.comOffice: 331-425-7705 ",
      "30":"Genesis10 is seeking a Sr. Business Data Analyst for a 6-month contract position with a client in Eagan, MN. Genesis10 provides access to career opportunities with over 40 clients in the Twin Cities. As the #3 ranked firm for Business and IT consulting in Minnesota, we offer a variety of opportunities whether you are looking for contract, contract-to-hire, or permanent positions. Let's connect today! Responsibilities:   * Data gathering and analysis as part of assigned tasks and projects * Creating data visualization as part of assigned tasks and projects * Assist Editorial Service teams with market analysis and related requests * Assist in Market Analysis, Jurisdictional build and retention model projects * Assist in development and implementation of Strategy Insights Framework in the areas of data analysis, KPI development and reporting * Interact with partner teams to manage tasks and projects * Other projects and tasks as assigned Qualifications:   * Bachelor's degree * BS in statistics, math or data science related field of study preferred * Experience in a Business Analyst or related role involving data analysis * Strong Excel skills including charting, Pivot tables, statistical and data cleanup functions * Basic PowerPoint, Word, Outlook skills * Fundamental statistical, data analysis and visualization skills * Strong communication skills * Ability to build effective working relationships with members of team and partner organizations * Good written and oral communications skills able to converse with many levels of the organization * Able to work with product, editorial, data and marketing teams (including segment partners) in a collaborative manner to achieve positive results * Strong team player who understands consensus and works toward the success of the team and organization * Ability to present ideas in a clear and concise manner * Able to work with little direct supervision * Able to work effectively in a team environment where team members may not be co-located * Self-motivated and pro-active * Good analytical and process improvement skills * Understands expectations that were set with team and recognizes when issues \/ events may affect delivery Preferred Qualifications:   * Ability to create SQL or MS Access queries and reports * Experience using Tableau or similar data visualization tools * Statistical modelling background a plus If you have the described qualifications and are interested in this exciting opportunity, apply today! Benefits of Working with Genesis10:   As a Genesis10 consultant, we are proud to offer access to the following benefits: * Medical and dental insurance * Bi-weekly payroll * 401k plan * Downtown Minneapolis\/St. Paul parking allowance * Delivery Manager for employee support * Successful re-marketing program * Referral program with the opportunity to earn additional income About Genesis10:   Genesis10 is a Professional Technology Services Firm providing Staffing, Workforce Optimization and Domestic Outsourcing Solutions. If you are a high performing business or IT professional with solid, referenced experience, we want to meet you. Genesis10 recruiters and delivery professionals are highly accomplished career advocates, who get to know you beyond your resume to position you with the opportunities that fit your skills, experience and aspirations. We have benefit options to fit your needs and a support staff that works with you from placement throughout your engagement - project after project. To learn more about Genesis10 and to view all our available career opportunities, please visit us at www.genesis10.com \"Genesis10 is an Equal Opportunity Employer, M\/F\/D\/V\"",
      "31":"Job Req #: 16-03602 Job Description:  Java Lead with eCommerce development experience - Key Responsibilities and Qualifications: Looking for two-to-three Senior Java Developers with experience in eCommerce. Strong Java, Spring Framework and Hibernate ORM.  The ideal candidate will have experience building their own e-commerce product or working with an existing ecommerce site.  Looking for typical eCommerce experience such as PIM, PCI, shopping carts, payment gateways, catalogs, etc.  Any experience with BroadLeaf, ElasticPath or KonaKart is a plus.   My client will train on the eCommerce tools.  Location:  Miami, FLPosition Type: ContractDiane DouglasSenior IT Recruiter\/Account LeadAscent303-694-5493 **If this is not a fit for you or you are not interested, Ascent Services Group offers an excellent Referral Bonus!  We look forward to hearing from you! About Ascent:The Ascent Services Group (ASG) is a nationally recognized technology staffing and consulting firm whose fundamental business is providing staffing services to Small, Medium, and Large Enterprise clients in our core market verticals: Financial Services, Healthcare, Technology and Life Sciences.  As consultants for ASG, you will have access to many of the top clients within the industries we serve.  Our goal is to deliver innovative talent through proven best practices and effective resource optimization.  Become one of ASG’s candidates and experience the difference!IND05 ",
      "32":"Clearance: Must be eligible to obtain a top secret clearance. We seek highly qualified, self-starting individuals to develop, implement, and test geolocation systems. This engineer will apply mathematics and physics to design and develop complex positioning systems for RF signals in demanding collection environments. In this role, the selected individual will be responsible for geolocation algorithm development, system engineering, and software implementation and testing. Experience with an existing geolocation approach\/engine in a classified application\/environment is a definite plus.Work includes system support through all phases of the life cycle from concept through final delivery, using an iterative design methodology to maximize productivity. Solutions are implemented on virtualized platforms. You will have access to a well-equipped computer \/ signal processing lab with emphasis on real data rather than simulation.Required:BS (MS or PhD preferred) in Electrical Engineering (preferred), Applied Math, Remote Sensing, or similar disciplineDemonstrated capability in scientific programming, especially C\/C++Relocation to sunny Tucson, Arizona; Denver, Colorado is a potential alternativePossess (or ability to obtain) and maintain an SCI security clearance (US citizenship required)Preferred: Experience with an existing geolocation approach\/observable processor in a classified application\/environmentStrong DSP fundamentalsApplicable background includes GPS or other navigation systems; geolocation observable processing of TDOA only and TDOA\/TDOA-dot (FDOA) measurements; electromagnetic propagation; multipath and interference mitigation; and mathematical techniques such as non-linear optimization and unbiased correlation.",
      "33":"Clearance: Active Secret required with strong preference for person with an in-scope TS\/SBBI.Position OverviewBuild your career at a technology-driven company dedicated to Solving Great Challenges. We engineer ground-breaking technologies in the areas of communications, safety, feeding the world, energy independence, and resource preservation. Grounded in a common sense approach to an ever-changing world, we are powered by the people who boldly mix drive, courage, integrity, and innovation into the focused ability to solve great challenges. Our strength as a company has always been our desire and drive to Solve Great Challenges, and our culture is built on collaboration, creative thinking, and problem solving.The Director of Product Development will be responsible for planning, managing and directing all product activities, to meet customer needs and fit within the capabilities of the division.  Achieve financial and investment return goals, growth forecast, and operational metrics.  The position will have primary responsibility for the execution of the strategic plan defined by the business development team.Execution of this plan will involve coordinating the efforts of the software, hardware and algorithm teams across product development efforts that span both radar as well as stratospheric solutions. Our radar products specialize in sophisticated radar processing to provide a highly sensitive, yet low false alarm rate tracking picture. These products are capable of land, maritime, and air tracking and can be deployed on towers, aerostats, vessels, and UAVs. We are actively developing new sensors as well as exploring new platforms on which to deploy these sensors. The engineering team responsible for radar and stratospheric product development and support is comprised of approximately 20 and can vary in size as the organization scales. Team members are geographically diverse with the largest concentration in Arlington VA Essential Functions• Develop and execute budgets, short-term plans, and long-term plans, policies, procedures, and initiatives. Work with leadership team to maintain accountability to budgets, plans, and initiatives. • Maintain close surveillance over product development and support activities to assure proper allocation of resources and  achieve deadlines. • Assist with the evaluation and selection of new raw materials and vendors.• Serve as a liaison and mentor to assist with and expedite product related issues.• Monitor and initiate improvement projects to current processes or policies.• May be involved in the specification and selection of new manufacturing equipment.• Coordinate and\/or direct major projects.• Work with leadership staff to develop and monitor metrics relevant to division business model.• Delegate appropriate responsibilities and assignments to team members.• Keep informed of new developments in the economy or marketplace that are relative to the success of the division.• Either directly or through team, assure staffing requirements are met.• Encourage team member growth and development.• Demonstrates the Dimensions of Competition and Team Member Values in their daily actions and encourages their teams to do the same.• Administer annual team member performance reviews, goal setting, and salary planning.• Maintain records on direct reports in relation to attendance and performance.• May be called upon to perform comparable duties of a similar or related nature and\/or assist in other areas as needed.• Learning, understanding, continuously improving, and promoting the division’s quality management system in accordance with ISO standards. Education\/Experience• Bachelor’s degree in business or technical field.• Minimum 8 years related experience; or equivalent combination of education and experience. Knowledge\/skills\/abilities• Thorough knowledge of product development and procedures, including knowledge of general accounting. Ability to manage a diverse range of technical operations. Experience managing budgets and increasing efficiencies.• Knowledge of TQM, Six Sigma, or Kaizen principles is preferred.• Demonstrated leadership, analytical, and decision-making skills.• High level of patience and service. Ability to motivate team members.• Ability to be flexible and multitask. Creativity and problem solving skills.• Computer proficiency, including Microsoft Word, Excel, and Outlook.• Ability to communicate effectively with team members and leadership staff.• Annual Motor Vehicle Record (MVR) check required.   ",
      "34":" Company Overview: Creating value by bringing together the right people to achieve results is our motto. Our clients and employees say they choose to work with us because of how we work with them - with service that exceeds their expectations and a personal commitment to their success. Our client, one of world’s largest manufacturers of medium & heavy-duty Trucks and Diesel engines, seeks an accomplished Senior .NET Developer. ***************************************************************************************************************************Candidate must be able to work without requiring sponsorship and should be open to FTE conversion***Description:The Senior .NET Developer will be responsible for implementing innovative web and console applications.Perform design, coding, testing, implementation, and documentation of solutions. Requirements:Candidates MUST have 7 solid years of relevant experience with prior long-term contracts\/employment.BS in Computer Science or 7 years’ experience..NET 4.5x development, MCSE preferredTFS (source code management), Web services including WCF, JQuery, AJAX, JavaScript, VB, VB Script, XML\/XSL; Cascading Style Sheets (CSS), Architectural design patterns.Sitecore experience preferred.Experience with at least one of the following databases: DB2 (v8.0 or greater), DB2 query, and DB2 Connect, Oracle, SQL Server.Ability to translate functional designs into technical designs, and conversely to translate complex information into common terms.Must be a strong technical leader who can prioritize well and has the ability to work in environments with competing and alternating priorities, with a constant focus on delivery.Strong analytical and problem solving skills.Excellent written and verbal communication skills.Accountable for partnering with key roles (enterprise architects, infrastructure, etc.) to create solutions that are aligned to architecture standards and principles, leverage common solutions and services.Experience working in a fast paced and demanding work environment. ************************************************************************************************************************ I'd love to talk to you if you think this position is right up your alley. If you're looking for rewarding employment and a company that puts its employees first, we'd like to work with you. We're driven, people driven. We also offer group health Insurance (employee paid on a pre-tax basis).Satwinder SinghLead Technical RecruiterTel: 925-297-6495Email: ssingh@ameritconsulting.com  NOTE: “Candidates that are offered a position are required to pass pre-employment drug and background screening”",
      "35":"PLEASE JOIN OUR TALENT NETWORK: http:\/\/bit.ly\/vhatalentnetwork  Joining the Talent Network with VanderHouwen & Associates (VHA) will enhance your job search and application experience. Job listings are mobile-friendly and easy to review, share, or apply. Whether you choose to just leave us your information or apply, we look forward to connecting with you. SummaryOur client is the leading provider of online video publishing and management solutions * millions of media files and process millions of hits per day. Media companies rely on their cloud-based video platform as their open, central hub for managing, monetizing, and syndicating billions of internet video views each year. Our client*s services provide unmatched versatility for designing and supporting streaming video businesses on PCs, mobile devices, and TV. Some of their customers include SyFy, Fox Sports Network, NBC Sports, National Geographic, Comcast, British Telecom, Travel Channel, and more. Their Consulting Services Team is seeking to add those with engineering knowledge \/ experience with the latest web and mobile technologies and come work as a Frontend\/UI Developer. The Consulting Services team works with a variety of customers to deliver world class IP-based video delivery solutions. Current projects include multiple initiatives for major media companies, as well as cable operators and telecommunication companies worldwide.  The Frontend\/UI Developer will be contributing to HTML5 video sites for high profile media companies, as well as to administrative consoles for media publishers and distributors using the latest JavaScript technologies. ResponsibilitiesDesign, estimate, and implement features for consumer-facing HTML5 video players based on client PDK technologies. Develop administrative user interfaces for Consulting Services customers for video management solutions.Collaborate with Project Managers and Solution Architects to plan and estimate customer solutions.Participate in a highly iterative agile development process as part of small cross-functional engineering team.Help the team diagnose and address complex client-side interactions.Qualifications BS Degree in Computer Science or a related field (BONUS).High level of communication skills. 4+ years* experience with front end JavaScript Development.CSS and HTML design implementation from wire frame to reality.Comfortable with a wide range of JavaScript technologies like Angular.JS, React, Node.js, JavaScript promises.Experience in a test-driven development environment.Team Lead experience (BONUS). ",
      "36":"Genesis10 has an incredible opportunity for a Business Development Executive to join our highly-successful Domestic Outsourcing Service Line. The Business Development Executive will be responsible, on a national-level, for acquiring new client logos through consultative-selling of the full spectrum of Genesis10's Domestic Outsourcing services. Genesis10's core competencies in Domestic Outsourcing include, but is not limited to Infrastructure, Application Development, and Managed Services. Today, Genesis10 has 6 certified Delivery Centers from which we provide services from today to the Fortune 500. The Delivery Centers are located in: Atlanta, Cleveland, Dallas, Detroit, Kansas City, and Orlando. Becoming a Genesis10 Domestic Outsourcing Business Development Executive is an excellent career move. Here is what your sales colleagues like most about being in sales at Genesis10: * Genesis10 will not cap your earnings and will do everything we can to empower you to exceed your compensation goals. Many of our sales team members are some of the highest paid in the industry! * Genesis10 has a proven track record with referenceable clients providing Domestic Outsourcing Solutions and is considered an early-adopter * Genesis10's Delivery Center Network if 6 locations in Tier 2, 3 and 4 cities across the United States has been recognized by the market analysts as a key differentiator * You are not on your own! Get the support you need to drive your success: + Executive Level Support: You will have direct-access to the entire Genesis10 C-suite to assist you in opening up doors, creating sales strategy, and closing deals + Dedicated Marketing Team: You will have a marketing team focused on ensuring that you have the sales collateral required to support the business development lifecycle from sales presentations, to whitepapers to reusable RFP content * Genesis10 is not a job; it is a family and a career where you can enjoy sustained success. Most of our sales organization has been at Genesis10 for 7-15+ years * Experience work\/life balance and trust from your organization. We realize that sales is a difficult role, requiring a lot of hard work and travel at times. Genesis10 is an organization that recognizes success is predicated on being in balance and enjoying the fruits of your labor How You Will Make a Difference:   As a Senior Business Development Executive, with experience selling outsourcing solutions, you will help drive domestic outsourcing business to Genesis10. * Utilizing existing relationships to drive Domestic Outsourcing business to Genesis10 * Using your 'hunter' sales approach, with the support of a top-tier delivery team, to open up new relationships and establish an optimal sales pipeline * Manage the end-to-end sales process for all pursuits, including lead-generation, client communications, on-site presentations, proposal development, and negotiation * Build strong internal relationships with Genesis10s' C-level executive team and the domestic outsourcing delivery team to gain optimal sales-support * Effectively collaborate with Genesis10's Delivery Center Operations Team to ensure that all awarded service proposals fully meet the client's needs Qualification Requirements:   * Multiple years of proven success selling global offshore or domestic\/onshore solutions * Established network of Directors, Vice Presidents, and C-Level relationships to help drive business * Tenured history, having worked multiple years for a recent employer * Demonstrated ability to apply a sales \"hunter approach to driving new business * Experience overseeing the buildout of proposals and contributing to the RFP process * Expert understanding of client outsourcing decision-criteria * Proven ability to work with remote or geographically disperse teams * Ability to travel to client-sites and Genesis10 Delivery Centers for onsite presentations If you've met these qualifications, I want to talk with you. If you are still reading, you must be interested! Reach out to me (Remster Bingham, Vice President of Recruiting rbingham@genesis10.com) today and gain a first-hand understanding of why Genesis10 is a career and not just a job! The Company:   Genesis10 is a professional technology services firm providing staffing, workforce optimization and domestic outsourcing solutions. If you are a high performing business or IT professional with solid, referenced experience, we want to meet you. Genesis10 recruiters and delivery professionals are highly accomplished career advocates, who get to know you beyond your resume to position you with the opportunities that fit your skills, experience and aspirations. We offer benefit options to fit your needs and a support staff that works with you from placement throughout your engagement providing career mentoring and support project after project. To learn more about Genesis10 and to view all our available career opportunities, please visit us at www.genesis10.com. Genesis10 is an Equal Opportunity Employer, M\/F\/D\/V  Start Date: 07\/05\/2016",
      "37":"Help invent the next generation of ecommerce; integrated experiences that leverage the store, and the web to sell anything, to anyone, anywhere in the worldThe Opportunity: -    Work in a small, high performance agile team environment - sharing innovative ideas and working collaboratively across teams. -       Work with talented engineers and product visionaries to contribute to the vision and design of our web and mobile properties. -       Create front end of interactive websites incorporating HTML5, CSS3, JavaScript, AJAX as well as other Web 2.0 techniques. -       Be a product-oriented Web Developer creating and experimenting with new ideas that will engage and excite our customers.Experience\/Skills required: -      Bachelor's degree in Computer Science or related technical field. MS\/PhDwould be a strong plus. -      3+ years' experience in HTML5, JavaScript, CSS3, AJAX and general Web 2.0 techniques in the context of interactive Web Applications. -       Strong understanding of responsive design techniques and principles-       A passion for all things JavaScript, UI and Front End-       Must be able to work effectively both on teams as well as be self-motivated, task oriented and organized.-       Strong customer focus and obsession with quality-       Ability to work in a fast-paced and agile development environment",
      "3":"Midtown based high tech firm has an immediate need for an innovative DevOps Engineer to help define Dev \/ Ops related processes, build out the automation.  In this position, the Dev \/ Ops Engineer will need to engineer technical solutions as well as perform process engineering. The ideal candidate has strong scripting skills for automation as well experience with configuration management, server deployment, and continuous integration and experience with tools such as Chef, Puppet, etc.  Must have experience with virtualization using VMware and Linux experience is preferred.  Experience with GO, Docker, Ansible, Microservices, and the Cloud are highly desired.   This is a permanent position with an innovative technology firm in Midtown that offers excellent benefits including bleeding edge technology, very generous PTO, matching 401(k), high-tech office environment, casual dress and a collaborative culture.  Need is IMMEDIATE!!    Category: Developer \/ Architect -Other",
      "27":"PLEASE JOIN OUR TALENT NETWORK: http:\/\/bit.ly\/vhatalentnetwork  Joining the Talent Network with VanderHouwen & Associates (VHA) will enhance your job search and application experience. Job listings are mobile-friendly and easy to review, share, or apply. Whether you choose to just leave us your information or apply, we look forward to connecting with you.Summary The ideal candidate is a clever, motivated and versatile coder with a hacker mentality who is eager to tackle complex problems. The candidate must be comfortable working in an agile development environment with high expectations for rapid delivery of prototypes, changing requirements, and direct feedback from the internal business customer.  Candidates should be able to learn fast and learn on the fly in order to work with a variety of languages, and be capable of taking responsibility for delivering code that accomplishes defined objectives.  Qualifications Required .NET and C# (Minimum 2 years* experience)Full development lifecycle experience including analysis, design, implementation, testing, monitoringSQL Server: Data modelling, T-SQL, Stored procs, Performance TuningBS or higher degree in Computer Science or related technical field. Qualifications Preferred Microsoft Azure or other cloud technologies Cosmos or other big data technologiesWeb API\/UI development",
      "39":"Genesis10's G10 Associates Program is seeking qualified Business Analysts to join our team! Program Summary:   As a wave of baby boomer retirement looms on the horizon, companies are recognizing a need to develop talent to fill the upcoming gap. This is why companies look to Genesis10 and the G10 Associates Program. Our innovative program mentors and develops the brightest recent graduates, turning them into G10 Associates who are business and technology professionals placed in client engagements with leading organizations in the area. The G10 Associates Program is continuing to grow and is looking for strong candidates with exceptional soft skills. New Business Analyst Consultants are enrolled in our Training Academy which provides our G10 Associates the background they need to succeed at our clients. Along with training and mentorship, we provide a competitive salary, benefits, and direct client exposure that jump starts careers. Position Description:   As a Business Analyst Consultant with Genesis10, you build skills required in all phases of a project - focusing on many industries, methodologies, processes, and technology platforms. From defining business requirements and designing technical solutions, to developing and testing enhancements, Business Analyst Consultants turn ideas into reality. You will collaborate with client and project teams to turn business requirements into detailed design specifications, and then build or enhance systems and business processes to meet their needs. Business Analysts are very comfortable with working in a team environment, and they possess solid communication and documentation skills. Experience\/Skills:   * 3-6+ months of corporate work\/internship experience * Healthcare experience or knowledge * Strong interpersonal and group communication * Experience working within a project team * Excellent problem solving skills very analytically minded * Understanding of business process improvement * MS Office applications * Bachelor Degree in Management Information Systems, Information Systems, Health Information Management, General Business, Communications, Marketing, Psychology, Economics, Finance or related field Desired Traits:   * Knowledge and understanding of the Software Development Lifecycle * Exposure to Business Applications * Ability to stay focused while performing heads-down work * Self-starting with a strong work ethic * Able to manage time effectively * Excellent team attitude * Professional demeanor * Desire to work in corporate environment and develop consulting skills * Personal accountability If you think you have what it takes to be the next great G10 Associate APPLY NOW! Qualified and interested candidates should apply now for immediate consideration. About Genesis10:   Genesis10 is a leading U.S. business and technology consulting firm with hundreds of clients needing proven talent and solutions to power their strategic initiatives. If you are a high performing business or IT professional with solid, referenced experience, we want to meet you. Genesis10 recruiters and delivery professionals are highly accomplished career advocates, who get to know you beyond your resume to position you with the opportunities that fit your skills, experience and aspirations. We have benefit options to fit your needs and a support staff that works with you from placement throughout your engagement project after project. To learn more about Genesis10 and to view all our available career opportunities, please visit us at www.genesis10.com. Genesis10 is an Equal Opportunity Employer, M\/F\/D\/V  Start Date: 06\/27\/2016",
      "40":"Global Financial Systems (GFS) is looking for a driven, results-oriented leader to lead teams building the next generation of systems to automate and optimize critical financial processes. Our ideal candidate thrives in a fast-paced environment, relishes working with big data, enjoys the challenge of highly complex business contexts that are typically being defined in real-time. Above all else, the successful candidate will be a passionate builder of talent and teams.In this role you will be responsible for leading a team of functional analysts, engineers, and technical program managers to create world-class finance systems that support Amazon's global footprint. You must be willing to insist on the highest standards for quality, maintainability, and performance. The systems we own are responsible for trillions of financial events and payment flows that would rank among the largest countries in the world by GDP. You will ensure that engineering best practices are followed and that software is designed to be highly-available, dynamically scalable, and resilient to continuity threats. You will own the goals and roadmap of the your team, along with the strategic direction of your software and shape of your organization. You will demonstrate strong leadership as you control your own destiny in Amazon's ownership oriented culture.Our team operates ERP and custom software platforms that are among the largest in the world by volume and complexity, and a successful candidate will be able to dive deep into either realm to guide technical and functional decisions with their team. As a leader, you will drive architectural and design choices, invent new features, develop distributed services, and build a scalable, service-oriented platform for our people . We have a team culture that encourages innovation and we expect developers and management alike to take a high level of ownership for the product vision, technical architecture and project delivery. Successful candidates will be high-bandwidth leaders who can cut through the noise, simplify relentlessly, deliver results, and build great teams around themselves.  5+ years of technical management experience Track record of building and delivering mission critical, 24x7 production software systems   Deep understanding of engineering best practices Deep understanding of agile project management methodologies Experience writing custom production code Working knowledge of data structures, algorithms, and object oriented design Working knowledge of design patterns Experience with global technology implementation efforts and rollouts Experience working with ERP platforms and integration at scale Experience in the Finance, Accounting or Tax domains. Bachelor’s degree in Computer Science or equivalent Master’s degree in Computer Science or equivalent ",
      "42":"Position:   Software Engineer (Algorithm)Duration:  6+ MonthsLocation:  Bridgewater, NJResponsibilities:The candidate is expected to play research and development.Under the supervision of a senior scientist\/researcher areas of advanced computer vision\/media processing technologyQualifications \/ Requirements:Ph.D or Master degree in relevant discipline\/field, such as EE or CSStrong programming skills in C \/ C++ for both Windows and LinuxGood programming skills in Java and Python is a plusAmple hands-on experience with OpenCVExperiences with Android programming is also a plus.3+ years algorithm R&D experiences processing, and related fields with proven track recordGood communication skills, both verbal and writtenan active role in computer vision technology or project leader to conduct research \/ development work in thetechnology.CS is a mustStrong plus in the areas of computer vision, information retrieval, machine learning, media record.End-to-end advantages in telecom network infrastructure, position in the All-IP convergence age.Our products and solutions through communication.  \/\/\/\/\/*****Any query please call on 408 550 1287****\/\/\/\/\/\/",
      "43":"PLEASE JOIN OUR TALENT NETWORK: http:\/\/bit.ly\/vhatalentnetwork  Joining the Talent Network with VanderHouwen & Associates (VHA) will enhance your job search and application experience. Job listings are mobile-friendly and easy to review, share, or apply. Whether you choose to just leave us your information or apply, we look forward to connecting with you.  SummaryOur client is looking for an expert Sr. JavaScript Developer with experience on AWS (Amazon Web Services). Qualifications Required 5+ years' full-time professional software developer experience. 3+ years* experience on node.js (JavaScript), Expert-level knowledge.2+ years* experience on AWS (EC2, Lambda, ECS, S3 AWS API GW).Qualifications Highly Preferred BS in computer science or related discipline.Experience with Docker and\/or AWS ECS service.Experience with REST API and design (SWAGGER).Experience with GIT configuration management tool.Successfully delivered at least one node.js based application into production environment.Experience Working in a collaborative Agile Software Development (SCRUM).Track record of delivering solutions under tight schedules. Strong oral and written skills in English. Qualifications Preferred Working knowledge of Java. Worked on both Windows and Linux development. Experience on IOT solutions. Knowledge of retail applications. Experience with RFID. Experience deploying Node.js applications on client and\/or IOT platforms.",
      "44":"Duties: Using SAP APO, provide materials scheduling support for Oceanside manufacturing.Develop and deploy standard metrics, scheduling analysis for site scheduling activitiesGather input from Site Schedulers to propose solutions to move capacity scheduling from excel into APO.Provide project management support and development of Site Scheduling portfolioPerform other ad-hoc analysis as needed. The environment is fast paced but the job tasks are more analytical and slower moving. Skills:Working knowledge of SAP APO, R\/3 and BW reportingAdvanced MS Excel skillsUnderstands solutions design and implementation, including requirements definition, data acquisition processes, data modeling, process automation, and deployment.Requires close interaction with the business groups and technical teams within Site Scheduling, Manufacturing and Facilities.Strong project management skills.Strong organizational skills.Excellent verbal and written communications skills.Must be able to prioritize.Ability to work on numerous and multi-faceted projects at the same time.It is very important that candidates have at least 2 years with SAP experience and that they can monitor SAP alerts\/shortages. All reporting will be done through SAP with Excel as the secondary.  Education:Bachelor’s degree in Industrial Engineering, Information Technology or Business Administration preferred but not necessary with 2-5 years of experience in a similar role. APICS certified preferred but not necessary. ",
      "45":"PLEASE JOIN OUR TALENT NETWORK: http:\/\/bit.ly\/vhatalentnetwork  Joining the Talent Network with VanderHouwen & Associates (VHA) will enhance your job search and application experience. Job listings are mobile-friendly and easy to review, share, or apply. Whether you choose to just leave us your information or apply, we look forward to connecting with you.Responsibilities Provides companywide strategic, analytical, and technical support for Information Delivery activities. The analyst acts as an intermediary between the business community and the technical community working with IT project teams and business partners to collect, clarify, and translate business requirements into documentation, conceptual designs, and Information Delivery solutions.Partners with business departmental teams to define and document business requirements for new metrics and reports.Elicits requirements using interviews, document analysis, requirements workshops, surveys, site visits, business process descriptions, use cases, scenarios, business analysis, and task and workflow analysis.Creates user-centric designs based on business and functional requirements, user research, market analysis, customer feedback, and usability findings.Designs user interfaces by using conceptual design techniques such as creating visual mock-ups, prototypes, and diagrams.Projects: 50%Day-to-Day Support: 40%Adhoc Request: 10%Qualifications Required Bachelors Degree in Computer Science or a related field is a bonus, but is not required.Certifications are a bonus, but are not required.5+ years of experience in working in systems and applications analysis.Data modelling, database design, database administration and web support.Data collection, data mining, data hygiene, and a close attention to detail. Accuracy is everything for reporting.Experience working in the Microsoft SQL Reporting Services Suite: SSRS, SSAS, SSIS (importance in that order).Database experience in SQL and T-SQL: will create stored procedures, pivot tables (PowerPivot \/ PowerView), views, triggers, etc.Additional tasks include supporting the company intranet through SharePoint Administration.Must have excellent communication and collaboration skills, as this team works across multiple groups. Someone that can create and build true internal partnerships, open communication skills, a propensity to learn and expand on their abilities, an ability to handle a constantly changing environment, and that can deal with ambiguity.Must be self-motivated and be able to take loose requirements and be creative with it.Qualifications Preferred Data Visualization experience is a major bonus.SharePoint Administration experience.Experience working in Cognos, Tableau, SAP Business Objects or any of the other major reporting tools.",
      "46":"We need a Project Coordinator person that can handle IT procurements (ordering supplies, sw, hw etc), Contracts\/PR's entering & tracking and following up with internal teams and vendor contacts to fulfill them etc.Also exposure to IT budget tracking is preferred. ",
      "47":"Primary Skills: Systems Admin, Devops, Scripting,Linux\/unix, Load Balance F5Contract Type: W2 Only Duration: 4 Months Contract to Hire Responsibilities: Engage closely with architects, engineering and operations teams to deliver highly available and scalable services with minimal\/zero downtime. Build automation scripts and frameworks to improve operational processes and procedures. Learn, deploy and document newer technologies for the potential deployment of services following a development and release life cycle. Support production escalations as needed. Driving ongoing improvements and efficiencies in operational practices, tools & processes. Provide a seamless transition of the application from Product Development to Production Support teams.Required Skills: Strong knowledge\/experience with Application and Infrastructure Delivery automation, orchestration and configuration management. Experience operating and troubleshooting VMs in a virtual environment. Ability to effectively communicate with various teams and levels of management Troubleshooting production issues Configuration, management, and performance tuning of App\/Web tier (Apache, Jboss, Tomcat, etc.) Operating Systems RHEL, CentOS, Windows 2012+ Applications Java, Tomcat Scripting BASH, Ruby, Python, Perl Version control Perforce Build\/Release - Jenkins, Maven, GCC, Make Package YUM\/RPM, Zip, Tar Deploy Capistrano, Terraform Provisioning vRA, vSphere, AWS Storage Netapp NFS Mounts and CIFS Networking Infoblox, F5, vCNSQualifications: BS in Computer Science or related field, or equivalent experience. Current\/Recent 5+ years back to back related experience. In-depth Linux or other Unix system administration experience. Previous experience delivering a new product, including methodologies, for an enterprise solution.Experience: Extensive experience with Splunk or other log aggregation tools. Experience with Application Load balancing via F5 devices and network troubleshooting. Experience with programming\/scripting languages (BASH, Ruby, Python, Perl etc.) Experience in deployment automation, monitoring and maintaining large-scale services with various underlying dependencies in a complex environment.Preferred Skills: Experience with physical and virtual Networking; Cisco firewalls a plus. Experience with AWS and OpenStack a plus.Please apply directly with your updated resume or call Sandeep at: 408.816.2470 ",
      "48":"We are seeking an Oracle Business Systems Analyst for our Direct Client. Location: Burbank, CAContract-to-Hire Opportunity – Excellent Benefits Description: Client is looking for highly motivated and energetic individual to join their Oracle Applications team.  The incumbent will work with business teams, Oracle developers, database administrators, business analysts, Oracle fusion middleware teams.   Duties\/Responsibilities:Develop, implement and support Business solutions in Oracle R12 E-Business Suite environment particularly in  P2P, General Ledger, Asset Management, Projects modulesWork with Oracle Support for knowledge and issue resolutionSupport month end Period close activities.Support reconciliation between sub-ledgers and General Ledger.Create test scripts, lead and perform system testing.  Support user acceptance testing and go live.Assure adherence to all IT controls and maintain alignment with IT StrategiesManage application lifecycles including release planning (enhancement\/upgrade), maintenance (bug fix and routine patching)Performs other duties as assigned or requested Requirements: A Bachelor's Degree in Computer Science or related field is preferred.7 + years of experience as a functional analyst in Oracle Applications 11i, R12Expert in General Ledger, Asset Management, ProjectsVery good knowledge in AME, Workflow, Sub-ledger Accounting, iSupplier, iExpensesWorking knowledge in other Oracle modules and Purchasing integration with Vertex a plusExpert in application support including problem analysis and resolutionAble to work as a liaison between the business community and technical teamPossesses excellent problem solving and communication skills (written and verbal)Knows how to use TOAD or other SQL tools to be able to write simple queries to perform data validations and to support end users.Capable of working in a fast paced, dynamic, team-oriented environment.Should be able to work independently under minimal supervision  If you or any of your friends are interested, please email me at the earliest. Regards,Carolyn BrooksTalent Acquisition Managercarolyn.brooks@ispace.com",
      "28":"Project Manager Contract postition located in downton San Francisco.  Sorry no H1B sponsorship available on this one.      Local and candidates willing to relocate are encouraged to apply.   A background in Banking, Wealth Management, Financial Services is a HUGE PLUS.   Any exposure to INFO SEC is a plus.  Any background in Operations Management is a huge plus.      Please email resume to Ellen at elerner@csi-it.com attached as a Word Doc.    Please include rate info.  You must have GOOD CREDIT in order to qualify for this role. Key Skills, Knowledge and Abilities:· The Project Manager (with some business analysis skills) who is well-versed in Banking, Wealth Managemennt, Financial Services, Regulated environments. security architecture and controls; familiar with current and emerging threats; able to develop risk mitigation strategies required to protect the confidentiality, integrity and availability of information systems and client data; proficient at working with senior management, internal business units and vendors to resolve risk issues and to develop efficient and effective action plans; familiar with the laws, regulations, industry standards and guidance pertaining to information security; experienced in the oversight of multiple, complex projects; and able to effectively manage a team of risk analysts. Must have excellent verbal and written communication skill, the ability to understand business requirements and skill in interacting with and influencing senior management.· Requires a four-year college degree with emphasis in a computer related field or the equivalent skills, knowledge and mental development.· Requires a minimum of ten years in Project Managemebt and a background in Information Security and Risk Management with prior experience in a security management leadership position managing a security and governance program is a huge plus.  .· Requires hands-on experience with security management products.· CISSP and CISM\/CISA certifications preferred.· Requires working knowledge of IP routing and networks, encryption, firewalls, intrusion detection systems, VPN’s, UNIX, Linux, and Windows operating systems and identification, authentication and authorization systems and accounting policies.· Must possess excellent written and oral communications skills and the ability to problem-solve technical issues.· Requires the application of compliance and risk management efforts within a highly regulated environment.· Must be able to clearly define and present ideas, and effectively communicate with all levels of management.· Requires the flexibility to act in both a strategic management role as well in a technical leader capacity when required.· Requires proficiency with varied types of computer hardware and software and with varied computer and network operating systems.· Must possess a general knowledge of all bank operations.· Must exercise a reasonable amount of independent judgment under a minimum of supervision.· Requires strong interpersonal and organizational skills, including the ability to meet deadlines.· Requires analytical abilities to weigh each identified security risk against the expense of enforcing and monitoring its mitigating security control.· Requires the ability to lead a strong team and achieve results in a challenging environment.· Team player· Provides extraordinary serviceBasic Skills and Experience Required: · Effectively manage a team of risk analysts· Excellent verbal and written communication skills and the ability to problem-solve technical issues· Requires a four-year college degree with emphasis in a computer related field or the equivalent skills, knowledge and mental developmentRequires hands-on experience or at least familiarity with security management productsPossess a general knowledge of all BANKING operations.CISSP and CISM\/CISA certifications preferred· Requires working knowledge of IP routing and networks, encryption, firewalls, intrusion detection systems, VPN’s, UNIX, Linux, and Windows operating systems and identification, authentication and authorization systems and accounting policies· Well versed in security architecture and controls· Familiar with current and emerging threats· Able to develop risk mitigation strategies required to protect the confidentiality, integrity and availability of information systems and client data· Familiar with laws, regulations, industry standards and guidance pertaining to information security· Experience in the oversight of multiple, complex projects· Ability to understand business requirements and skill in interacting with and influencing senior management. ",
      "26":"Genesis10 is seeking MxU Construction Coordinators in Chicago, IL! As an MxU Construction Coordinator, you are responsible for providing technical solutions and managing relationships with the client's MDU product team. Your role is key in moving our clients MDU (multi-dwelling unit) projects from sales throughout completion of construction. You will have a demonstrated passion for account management with an entrepreneurial spirit and passion for client management, eventually managing a small team of temps across Fiber cities in your region. Our clients projects, like their users, span the globe and require managers to keep the big picture in focus. As an MxU CC, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it's your job to keep all the players coordinated on the project's progress and deadlines. Responsibilities Manage Salesforce construction project tickets end to end and ensure all SLA's are being met Attend staff meetings and assist Fiber sales with engineering & construction questions as requested by Fiber sales or engineering teams Work with partners closely on the end to end process from site selection to installation including contracts, escalations, scheduling, etc. Work closely with cross-functional teams:   construction, legal, product, PR, management team, etc. Partner with the local construction team to provide weekly metrics and updates for each city in your region Own and manage projects with multiple stakeholders, both ongoing and ad hoc basis. Track progress of multiple sites and keep team's progress updated Minimum Qualifications 3-5 years of industry or sales\/account management experience working with clients and setting expectations appropriately with strong customer satisfaction scores. Ability to work cross- functionally with Sales & MDU operations, as well as our local sales teams, engineering, marketing, and field management to ensure our client SLA's are explained and executed on time BA\/BS degree Project\/program management experience; deadline and detail-oriented (PMP preferred) Experience in measuring and improving productivity, and scaling initiatives Preferred Qualifications Proficiency in using Salesforce strongly preferred Understanding of MDU process flow from contract to construction completion. Comfortable with database management & MDU design An understanding of MDU engineering & construction, such as various industry design standards, and construction methods in both condo & tenant MDU environments Flexible (ability to work across different time zones) and able to think quickly Experience training and mentoring junior colleagues If you have the described qualifications and are interested in this exciting opportunity, please apply! About Genesis10:   Genesis10 is a leading U.S. business and technology consulting firm with hundreds of clients needing proven talent and solutions to power their strategic initiatives. If you are a high performing telecommunications or IT professional with solid, referenced experience, we want to meet you. Genesis10 recruiters and delivery professionals are highly accomplished career advocates, who get to know you beyond your resume to position you with the opportunities that fit your skills, experience and aspirations. We have benefit options to fit your needs and a support staff that works with you from placement throughout your engagement - project after project. To learn more about Genesis10 and to view all our available career opportunities, please visit us at www.genesis10.com. \"Genesis10 is an Equal Opportunity Employer, M\/F\/D\/V\"",
      "4":"We are looking for a Senior SAP FICO Architect to join us fulltime and support our ongoing projects and customers. Must have excellent Pre-sales experience.Consultant should be ready for 100% travel. If interested, Please send us your updated resume, best time and contact numbers to girish(dot)bandaru(at)yash(dot)com to discuss more on this opportunity. Thanks & Regards Girish BandaruYASH Technologies773-828-4341girish.bandaru@yash.com",
      "1":"The University of Chicago has a rapidly growing security program with many opportunities for a motivated person to work in a variety of roles and many technical areas.  This position is responsible for providing incident response, information security assessment, monitoring, and system administration under the general direction of the Information Security Officer and the Lead Information Security Engineer. Essential Functions: Execute IT Security Network Monitoring and Incident Response procedures. Lead or participate in IT Security projects. Administer IT Security systems, including updates, backups, and upgrades Consult, advise, and provide security assessment services to application development or acquisition projects to assess security requirements and controls and to ensure that security controls are implemented as planned. Research security issues and contribute to IT Security communications, web pages, blogs, and awareness materials. Document internal processes, write security standards and guidelines. Other duties as assigned  Qualifications:Bachelor's degree OR a minimum of four years of experience in the Information Technology field OR an equivalent combination of education and experience required.  Minimum two years of professional experience in a technical Information Security role required. Experience administering linux\/unix systems is required. Experience administering Windows systems is preferred. Experience with programming or scripting languages such as Perl or Python strongly preferred.  The University of Chicago is an Affirmative Action\/Equal Opportunity\/Disabled\/Veterans Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, status as an individual with a disability, protected veteran status, genetic information, or other protected classes under the law. For additional information please see the University's Notice of Nondiscrimination.Staff Job seekers in need of a reasonable accommodation to complete the application process should call 773-834-1841 or email talentacquisition@uchicago.edu with their request.",
      "5":"Network Engineer Job Description A Network Engineer is responsible for analyzing, designing, installing, configuring, maintaining and repairing of network infrastructure and application components. A Network Engineer performs a wide variety of evaluation, maintenance, installation and training tasks to ensure the computer network performance meets company and user satisfaction. A Network Engineer also provides direction, information, and recommendations regarding network configurations and installations. PRIMARY DUTIES AND RESPONSIBILITIES:   * Maintain a thorough understanding of the basics behind the Internet and its workings (DNS, Security, IP Routing, HTTP, VPN, Email Routing, SPAM, etc.) * Configure and setup Cisco Firewalls, VPN Concentrators and Security appliances for access to vital business applications * Design, setup and configure complex switching environments * Design, setup and configure complex wireless networking that supports open or secured access and the ability to support voice and video applications * Maintain a thorough understanding of Local Area Networking * Assist in the design of multi-server environments including IP address schemes, DNS, WINS, EtherChannel (Bonding), etc. * Configuring and installing client and server network software for upgrading and maintaining network and telecommunication systems. * Maintaining multi-site network operations and software applications, operating systems and regular maintenance with both private and public facilities * Managing assigned projects and program components to deliver services in accordance with established objectives. * Responding to inquiries from staff, administrators, service providers, site personnel and outside vendors and etc. to provide technical assistance and support * Supervising the administration of systems and servers related network to ensure availability of services to authorized users.  Date Posted: 06\/10\/2016",
      "6":"Bluebeam is looking for talented sr. web developers with a passion for building robust, performant, scalable, high availability web applications. You should have extensive web development experience including designing RESTful services utilizing relational and no-sql databases in a testable framework.  Want a peek at who you would be working with? Our software developers are friendly, fun, intelligent, hard-working team members devoted to developing software right.  They have an ability to see the big picture throughout the design and development process.  We are highly-collaborative so you should have a capacity to contribute to and learn from the team in constructive debates in order to coalesce multiple points of view into effective unified solutions.  We work in small fast-paced scrum-agile teams. You would be working alongside software engineers, and product and project managers who are self-starters passionate about delivering clean, dependable software solutions.  To work well with the team you should have an ability to clearly articulate solutions to complex problems both to technical and non-technical people.   What we'd need to see:5+ years of experience in a related field (Candidates will be considered for engineer or senior engineer based on experience)Bachelor’s degree or higher in a computer science or equivalent fieldExtensive use of APIs and understanding of HTTP and REST architectureExperience using OO methodologies in designing software solutionsStrong understanding of design patternsProven ability to work in a rapid release production environmentFull understanding of the SDLC Experience with developing scalable software systemsAbility to clearly articulate solutions to complex problems; when developing solutions, ability to see the big picture What we’d love to seeComfort with working in an Agile\/SCRUM environmentProven Web Development experience in .NET technologies, particularly C# and Web APIUnderstanding of machine learning algorithmsExperience with cloud technologies such as Azure or AWSExperience developing microservice-based architecturesAbility and propensity to generate and share extremely delicious baked goods  If you think you are a good match for Bluebeam, please send the following:Cover Letter (Try to show us who you are.  If you send us the generic one you send to everyone else, we will be bummed.)ResumeSamples of your web development work (Be prepared to discuss) Learn more about Bluebeam here: http:\/\/careers.bluebeam.com\/. ",
      "7":"This is a fulltime position for a Javascript developer for a financial software, data, and media company. This role is based our of the Midtown, NY location (candidates must work onsite). You'll be part of a team working on the application that is the glue that holds the firm's main product together and is used as a communication tool, a price dissemination system and a way to receive information from all other applications within the firm. Responsibilities:   Help us design, create and build our next-generation user interface Be a key contributor in the re-architecting of our application service layers to improve our scalability, stability and performance Work with the team, our product and our customers to define priorities and the technology we use Work with other teams and learn about our search infrastructure, core databases and how we support hundreds of applications through our APIs Required Skills and Experience:   3+ years of production-level development Solid JavaScript knowledge Must want to and like working on UI Preferred:   An understanding of C++ fundamentals Experience working on other highly visible applications  Start Date: 06\/03\/2016",
      "8":"Must have skills: UNIX, IAM (Identity Access Management), Scripting knowledge, and 5+ years of total experience in this role required. OIM (Oracle Identity Manager) or other similar tools are required. The ideal candidate has worked as a Systems Administrator and\/or Information Security Analyst in the past.Nice to have skills: Knowledge of SQL, coding languages, and Windows are really nice to have. Active Directory is also really nice to have. DescriptionThe ideal candidate for this position will be a proactive and self-motivated professional who will work with other team members to manage access controls for our client's key information resources residing on multiple platforms, with a focus area in Windows, UNIX, Linux. The successful candidate will have strong scripting skills to support the automation effort within the team. Education\/Experience:• Bachelor degree in computer management, information security or equivalent job experience• CISSP, CISA, CISM and other comparative information security certifications are preferred• 5 to 7 years computer security experience required Responsibility level:• Provide support in account provision and de-provision in Windows and UNIX systems in Active Directories\/UNIX Enterprise Directories• Complete access request processing as per pre-defined sets of procedure and within agreed Service Level Agreements (SLA), resolve problem tickets and assist other security analysts as needed• Document access management procedures for assigned platforms, databases and applications; keep the access management procedures up-to-date• Proactively identify audit and compliance access related issues to reduce the risk of security exposures on the support systems and applications; coordinate access management related audit and compliance tasks, such as user access reporting and other relevant research and investigation• Flexibility to work adjusted hours, after hours and weekends to accommodate and support the existing servers\/applications maintenance windows• Identify process automation opportunities on existing access management practice.• Work with team members to design and develop solutions to streamline and automate existing manual process• Flexibility to work adjusted hours with Global Team members as needed to support training and processing needs.• Exercises independent judgment with minimal direction from supervisor Qualifications\/Requirements:• Detailed knowledge of the security sub-subsystems and 3rd party security products such as Oracle Identity Manager(OIM), Random Password Manager (RPM), Active Roles Servers(ARS), Etc.,• Subject matter expert on UNIX and database security products and their use on protecting information resources• Ability to gather and document business requirements and implement solutions to address them• Good working knowledge of Identity Access Management lifecycle and processes• Understanding of information security principles and IT infrastructure including operating systems, applications, communications and network protocols.• In-depth and proven knowledge in building automated solutions using various coding languages (Java, C#, VBA, vbscript, Perl and Shell script, etc.) is really nice to have.• The ability to work effectively with other functional areas and understand the operational and cultural issues relevant to achieving superior results• Must be flexible and able to manage multiple tasks and priorities on very tight deadlines.• Be a self-motivated and results oriented individual with an attention to driving aggressive project timelines and schedules• Ability to work independently and in collaboration with others to achieve a high level of success• Strong interpersonal and collaboration skills with the ability to develop, maintain and foster constructive relationships with others• Dynamic, hard-working and ambitious individual, with excellent oral and written communication skills• Have an attention to detail and advanced analytical and troubleshooting skills",
      "2":"GalaxE.SolutionsEvery day, our solutions affect people throughout the world. From Fortune 100 companies to start-ups, GalaxE develops and implements strategic projects that are critical to the success of customers’ businesses and the lives of tens of millions of people. For over twenty-five years, we have grown and evolved into a multi-national firm that employs over 2000 team members worldwide. But we’re not done evolving. It took collaboration and innovation to get here, and it takes collaboration and innovation to get where we (and our customers) want to be tomorrow.   What does this mean for our employees? They have the security of an established company, with the benefits of working for a company where great minds, hard work, leadership and innovation are highly regarded and rewarded. As Thomas Edison said, “There’s a way to do it better – find it”. We want our employees to find it. We’re looking for creative people, with an entrepreneurial spirit, looking to work on awesome projects! Sound like you? Come work with us! Find out for yourself what it means to be part of the GalaxE team. It’s not always easy, but important work never is. #WeAreGalaxE  Develop a practical roadmap for an enterprise-wide BI reporting and analytics platform with consideration to business objectives, technological considerations and budget. Define the overall BI data architecture which could include: ETL processes, ODS, EDW, data marts and data lakes.Provide BI technical and architectural guidance to project and project teams to ensure that new initiatives enable effective data reporting.Develop new reporting solutions if requiredIdentify, evaluate, and provide proposals for solutions to identified process and data quality issuesDocument best practices and methodologies for development standards, data governance, version control, deployment and change management.Perform quality assurance testing of reports and dashboards, and perform user acceptance testing (UAT). Technical Experience:   Core understanding of Business Intelligence \/ data warehousing technologies, methodologies, and techniques of: data discovery, data sources, presentation layer, etc., with proven experience with delivering successful solutionsExcellent knowledge of data warehouse principles and reporting.Experience in the design and building of enterprise data warehouses.Extensive experience in BI report, web and mobile dashboard development. Experience in multiple database platformsExperience with data analysis, assessing data quality and developing corrective actionsThorough understanding of complex large scale data modelsUnderstanding of common SDLC practices\/methodologiesExperience working with end users to gather requirementsExperience using data discovery toolsUnderstanding of RDBMS  ",
      "10":"Genesis10 is currently seeking a Sales Engineer for a steel company in Los Angeles , CA. This is a direct hire position. Summary This position leverages strong commercial and technical skills and industry experience to recognize customer needs and apply the company capabilities and technology across the full portfolio of the products and services. Responsibilities:   * Fully understands and leverages the company value proposition to maximize price and sales to grow and protect business * Successfully eliminates price as an objection when delivering new products or projects * Expected to demonstrate leadership skills by influencing, driving for results, and resource commitment * Provide customer expertise including leading customer negotiations, developing pricing strategies, and managing a portfolio of business accounts * Ownership of the technical relationship with customers by providing consistent and expert technical support, across the Timken portfolio of products and service, additional expertise in areas required for assigned customers when necessary. * Manage sales process for assigned customer accounts or territory * Makes target number of customer calls and attains sales targets * Delivers high-impact customer presentations that focus on capabilities, solutions and value proposition * Works with Customer Engineering on complex system analyses, including bearing selection on non-standard part number or types * Develop customer-based sales plan including sales, won\/lost busines, plans to maximize pricing, new business attainment * Actively gather and submit customer and market knowledge into monthly demand planning process * Ability to assume leadership role in the regional office such as pricing authority, participating in joint sales calls, mentoring sales engineers, etc... * Shares knowledge and mentors associates, espcially in solving problems and decision making * Develops and delivers customer-training or internal training presentation Required Skills:   * Bachelor of Engineering or Master of Engineering and Business * 4 to 8 years of working with or responsibility for progressively more complex projects that involve both commerical and technical issues * Extensive background in working with customers and developing long-term customer relationships and partnerships Desired Skills:   * Bilingual candidate preferredIf you have the described qualifications and are interested in this exciting opportunity, apply today! About Genesis10:   Genesis10 is a leading U.S. business and technology consulting firm with hundreds of clients needing proven talent and solutions to power their strategic initiatives. If you are a high performing business or IT professional with solid, referenced experience, we want to meet you. Genesis10 recruiters and delivery professionals are highly accomplished career advocates, who get to know you beyond your resume to position you with the opportunities that fit your skills, experience and aspirations. We have benefit options to fit your needs and a support staff that works with you from placement throughout your engagement project after project. To learn more about Genesis10 and to view all our available career opportunities, please visit us at www.genesis10.com. Genesis10 is an Equal Opportunity Employer, M\/F\/D\/V  Start Date: 06\/07\/2016",
      "11":"Location Atlanta, GAJob Title Test Lead \/ ManagerDuration 6 Months + High possibility of ExtensionRequired Skills: * 4+ years of experience in Software Testing and Quality Assurance.* Good communication skills* Good understanding of Telecom Network* Good knowledge and experience on preparing Test Plan and Test Strategy documents.* Great understanding of Defect detecting, tracking and reporting techniques.* Excellent Logical and Reasoning skills with keen eye to detail.--------------------------------------------------------------------------------------------------------------------------------------------Submit your resume on this position by clicking Apply button on this page or call Utpal @ 973-841-2390 and email: utpal.raj@collabera.com to contact recruiter to discuss details about this position--------------------------------------------------------------------------------------------------------------------------------------------",
      "12":"VanderHouwen has more jobs you may like!  Find them here: http:\/\/bit.ly\/1RIQfgE PLEASE JOIN OUR TALENT NETWORK: http:\/\/bit.ly\/vhatalentnetwork  Joining the Talent Network with VanderHouwen & Associates (VHA) will enhance your job search and application experience. Job listings are mobile-friendly and easy to review, share, or apply. Whether you choose to just leave us your information or apply, we look forward to connecting with you. SummaryOur client seeking an individual who can apply extensive and advanced principles, theories, and concepts to the development of solutions to complex problems with innovation and ingenuity. Expert knowledge of Lawson Supply Chain modules and business practices.Responsibilities Demonstrate service excellence and positive interpersonal relationships in dealing with others, including patients\/families\/members, employees, managers, medical staff, volunteers, and community members, so that productivity and positive relations are maximized.Act as a system specialist or business consultant on complex projects or system, which can include planning and coordinating large scale projects or tasks across a multi-state enterprise, using cross disciplined team efforts.Provide technical and operational guidance to ensure that installed systems are working effectively and that proposed systems will meet the organizations future needs.Work with users, user groups, and vendors to gather requirements and provide fit gap analysis and effective technical solutions for the business needs.Provide documentation for testing, functional and technical designs and development processes as required by project management methodology.Develop and recommend technical support and software management standards, policies, procedures and strategies.Develop test plans to test application functionality of highly complex applications across multiple modules in support of patches, upgrades, and infrastructure and\/or desktop configuration changes.Respond to and resolve reported incidents according to customer support service level agreements.Participate in problem management and troubleshooting teams on major enterprise system issues.Design, implement, evaluate and facilitate systems tests for new applications or enhancements to current applications.Proactively evaluate and make recommendations around adoption of emerging standards. Mentors others regarding integration protocols and processes.Address topics and issues that are both strategic (long term) and operational (immediate) in nature.QualificationsBachelor's degree or equivalent blend of education and experience.Minimum of 10 years functional experience.Proficient in Microsoft Office Products.Proficient in the development and support of integration with other applications.Minimum of 10 years* experience with the Lawson Supply Chain product suite.Qualifications PreferredMaster's Degree.HealthCare Information Services experience.",
      "13":"Genesis10 is actively seeking a Messaging Administrator for a direct hire position within the insurance industry for our client located in Kansas City, MO. Description:   * Our client has an exciting opportunity for a Messaging Administrator who would enjoy working for an organization that strives every day to support the public good and make a difference. You will be working in the division responsible for hardware and software infrastructure as well as providing technology resources for regulatory systems and databases. If you hold a Microsoft Certified Engineer or Certified Information Systems Security Professional certification, we want to chat with you. * This position is located in, state-of-the-art offices in the heart of downtown Kansas City which includes great restaurants, and top-notch entertainment venues. This is a full-time position in a positive and flexible environment. Responsibilities:   * Providing administration and technical support for Technical Services enterprise backup systems including: + Administering, supporting, and maintaining the Veritas NetBackup Infrastructure. + Administering, supporting, and maintaining the IBM Tivoli Backup Infrastructure. * Providing administration and technical support for the internal e-mail network including: + Microsoft Windows Server 2008, Windows Server 2012, Microsoft Exchange 2013 support. + Administering the SMTP Mail Gateway servers, Mail flow, gateway filter blocks, virus scanning and virus blocks. * Administering and supporting mobile devices and server architecture: + Installing, configuring, and maintaining Mobile Device Management servers and environment. + Setup and configuration of mobile devices. * Providing administration and support of Lyris ListManager server product including: + Microsoft Server administration and troubleshooting of Lyris ListManager server. + Back-end listserver setup and support. * Carrying a pager and responds to it during and outside of normal business hours. The pager will be carried for a week at a time on a rotating basis. * Participating in a support role for national meeting. This includes travel and supporting systems away from the office for over a week at a time at least once a year. Requirements:   * Bachelor's degree (B.A. or B.S.) from a four-year college or university and three years' of related experience; or equivalent combination of education and work experience. A minimum of three years' of experience working with Microsoft Active Directory server administration is required. * Must have strong communication skills. * Must have an in-depth knowledge of Microsoft Active Directory administration and replication. * Proficient with server and workstation hardware. * Must have a sound knowledge of desktop and server operating systems (Windows 7, Windows 2008 or 2012 server) and distributed e-mail systems. * Must have very intuitive troubleshooting skills to look at the broad picture (i.e. consider network and server in resolving desktop problems). * Strong understanding of backup software and backup retention policies. * Only W2 candidates will be considered for this position. (no third parties) If you have the described qualifications and are interested in this exciting opportunity, apply today! About Genesis10:   Genesis10 is a leading U.S. business and technology consulting firm with hundreds of clients needing proven talent and solutions to power their strategic initiatives. If you are a high performing business or IT professional with solid, referenced experience, we want to meet you. Genesis10 recruiters and delivery professionals are highly accomplished career advocates, who get to know you beyond your resume to position you with the opportunities that fit your skills, experience and aspirations. We have benefit options to fit your needs and a support staff that works with you from placement throughout your engagement - project after project. To learn more about Genesis10 and to view all our available career opportunities, please visit us at www.genesis10.com \"Genesis10 is an Equal Opportunity Employer, M\/F\/D\/V\"  Start Date: 06\/08\/2016",
      "14":"Genesis10 is looking for a Business Analyst for a long-term contract position in Sandy Springs, GA with our Fortune25 financial services industry client. Only W2 candidates will be considered. Description:   As a Business Analyst, you will conduct business and technical analysis for process and tool enhancements and ensures operational readiness to satisfy business partner objectives. The Business Analyst will employ a set of tasks and techniques used to work as a liaison among stakeholders and core team members in order to understand the structure, policies and operations of an organization, and to recommend solutions that enable the organization to achieve its goals. Responsibilities:   * Business Analysis, Planning and Monitoring * Requirements Management and Communication * Enterprise Analysis * Requirements Analysis * Solution Assessment and Validation * Work with core team members to elicit, organize, document and validate business rules, functional and non-functional requirements * Partner with the product manager to build cohesive release content * Translate stakeholder requests into a set of system features. These in turn are detailed into specifications for functional and nonfunctional requirements * Ensure the functionality, usability, performance and supportability of the requirements * Assess capability gaps and identify new capabilities required by the enterprise to meet the business need * Understand the organizations business and how the technology supports the business * Assess or evaluate the impact of the change the stakeholder is requesting * Translates business needs into technical requirements and ensures all systems support business needs * Ensure the process of reviewing, selecting, and designing the solution is done in a way that maximizes value delivered to stakeholders * Assess defects and issues; determine the business impact and severity of the defect. Conduct analysis and root cause of defect * Facilitate meetings with the direct involvement of both stakeholders and developers to gather feedback on requirements and solution results and to produce the following key deliverables: + Actionable Requirements (Stories) + Process Maps + Gap Analysis + Scenarios and\/or use cases + Data Flow Diagrams + Analysis and submission of Change Control Forms Requirements:   * 5-7 years' experience in analysis with expertise in different technologies, business areas, application wide analysis, and proposal of solutions * Ability to interpret the domain in order to capture meaningful requirements * Strength in assembling, analyzing, and representing business requirements * In depth experience performing feasibility analysis, scope projects, prioritize deliverables, recommend alternative solutions and project strategies, and engage in negotiations * Responsible for high level implementation plans, data and process models, cost estimating, cost benefits analysis, and return on investments * Experience facilitating workshops such as JAD, RAD, and DRP sessions, etc. * Expert skills in MS Office (Word, Excel, PowerPoint) and strong Visio skills preferred If you have the described qualifications and are interested in this exciting opportunity, please apply! Only W2 candidates can be considered. About Genesis10:   Genesis10 is a leading U.S. business and technology consulting firm with hundreds of clients needing proven talent and solutions to power their strategic initiatives. If you are a high performing business or IT professional with solid, referenced experience, we want to meet you. Genesis10 recruiters and delivery professionals are highly accomplished career advocates, who get to know you beyond your resume to position you with the opportunities that fit your skills, experience and aspirations. We have benefit options to fit your needs and a support staff that works with you from placement throughout your engagement - project after project. To learn more about Genesis10 and to view all our available career opportunities, please visit us at www.genesis10.com. \"Genesis10 is an Equal Opportunity Employer, M\/F\/D\/V\"  Start Date: 06\/30\/2016"
   }
}